arduino/Arduino/hardware/c2000/cores/c2000/F2806x_common/include/F2806x_SWPrioritizedIsrLevels.h
//###########################################################################
//
// FILE:    F2806x_SWPrioritizedIsrLevels.h
//
// TITLE:   DSP28 Devices Software Prioritized Interrupt Service Routine
//          Level definitions.
//
//###########################################################################
// $TI Release: 2806x C/C++ Header Files V1.10 $
// $Release Date: April 7, 2011 $
//###########################################################################

#ifndef F2806x_SW_PRIORITZIED_ISR_H
#define F2806x_SW_PRIORITZIED_ISR_H

#ifdef __cplusplus
extern "C" {
#endif

//-------------------------------------------------------------------------------
// Interrupt Enable Register Allocation For 2803x Devices:
//-------------------------------------------------------------------------------
// Interrupts can be enabled/disabled using the CPU interrupt enable register
// (IER) and the PIE interrupt enable registers (PIEIER1 to PIEIER12).
//-------------------------------------------------------------------------------
//-------------------------------------------------------------------------------
// Set "Global" Interrupt Priority Level (IER register):
//-------------------------------------------------------------------------------
// The user must set the appropriate priority level for each of the CPU
// interrupts. This is termed as the "global" priority. The priority level
// must be a number between 1 (highest) to 16 (lowest). A value of 0 must
// be entered for reserved interrupts or interrupts that are not used. This
// will also reduce code size by not including ISR's that are not used.
//
// Note: The priority levels below are used to calculate the IER register
//       interrupt masks MINT1 to MINT16.
//
//
// Note: The priority levels shown here may not make sense in a
//       real application.  This is for demonstration purposes only!!!
//
//       The user should change these to values that make sense for
//       their application.
//
// 0  = not used
// 1  = highest priority
// ...
// 16 = lowest priority
#define	INT1PL      2        // Group1 Interrupts (PIEIER1)
#define	INT2PL      1        // Group2 Interrupts (PIEIER2)
#define	INT3PL      4        // Group3 Interrupts (PIEIER3)
#define	INT4PL      2        // Group4 Interrupts (PIEIER4)
#define	INT5PL      2        // Group5 Interrupts (PIEIER5)
#define	INT6PL      3        // Group6 Interrupts (PIEIER6)
#define	INT7PL      0        // Group7 Interrupts (PIEIER7)
#define	INT8PL      5        // Group8 Interrupts (PIEIER8)
#define	INT9PL      3        // Group9 Interrupts (PIEIER9)
#define	INT10PL     6        // Group10 Interrupts (PIEIER10)
#define	INT11PL     6        // Group11 Interrupts (PIEIER11)
#define	INT12PL     8        // Group12 Interrupts (PIEIER12)
#define	INT13PL     4        // XINT13
#define	INT14PL     4        // INT14 (TINT2)
#define	INT15PL     4        // DATALOG
#define	INT16PL     4        // RTOSINT

//-------------------------------------------------------------------------------
// Set "Group" Interrupt Priority Level (PIEIER1 to PIEIER12 registers):
//-------------------------------------------------------------------------------
// The user must set the appropriate priority level for each of the PIE
// interrupts. This is termed as the "group" priority. The priority level
// must be a number between 1 (highest) to 8 (lowest). A value of 0 must
// be entered for reserved interrupts or interrupts that are not used. This
// will also reduce code size by not including ISR's that are not used:
//
// Note: The priority levels below are used to calculate the following
//       PIEIER register interrupt masks:
//                           MG11 to MG18
//                           MG21 to MG28
//                           MG31 to MG38
//                           MG41 to MG48
//                           MG51 to MG58
//                           MG61 to MG68
//                           MG71 to MG78
//                           MG81 to MG88
//                           MG91 to MG98
//                           MG101 to MG108
//                           MG111 to MG118
//                           MG121 to MG128
//
// Note: The priority levels shown here may not make sense in a
//       real application.  This is for demonstration purposes only!!!
//
//       The user should change these to values that make sense for
//       their application.
//
// 0  = not used
// 1  = highest priority
// ...
// 8  = lowest priority
//

#define	G11PL       7        // ADCINT1     (ADC)  or reserved if 10.1 is ADCINT1
#define	G12PL       6        // ADCINT2     (ADC)  or reserved if 10.2 is ADCINT2
#define	G13PL       0        // reserved
#define	G14PL       1        // XINT1       (External)
#define	G15PL       3        // XINT2       (External)
#define	G16PL       2        // ADCINT9		(ADC)
#define	G17PL       1        // TINT0       (CPU Timer 0)
#define	G18PL       5        // WAKEINT     (WD/LPM)

#define	G21PL       4        // EPWM1_TZINT (ePWM1 Trip)
#define	G22PL       3        // EPWM2_TZINT (ePWM2 Trip)
#define	G23PL       2        // EPWM3_TZINT (ePWM3 Trip)
#define	G24PL       1        // EPWM4_TZINT (ePWM4 Trip)
#define	G25PL       3        // EPWM5_TZINT (ePWM5 Trip)
#define	G26PL       5        // EPWM6_TZINT (ePWM6 Trip)
#define	G27PL       2        // EPWM7_TZINT (ePWM7 Trip)
#define	G28PL       1        // EPWM8_TZINT (ePWM8 Trip)

#define	G31PL       4        // EPWM1_INT   (ePWM1 Int)
#define	G32PL       1        // EPWM2_INT   (ePWM2 Int)
#define	G33PL       1        // EPWM3_INT   (ePWM3 Int)
#define	G34PL       2        // EPWM4_INT   (ePWM4 Int)
#define	G35PL       3        // EPWM5_INT   (ePWM5 Int)
#define	G36PL       6        // EPWM6_INT   (ePWM6 Int)
#define	G37PL       5        // EPWM7_INT   (ePWM7 Int)
#define	G38PL       3        // EPWM8_INT   (ePWM8 Int)

#define	G41PL       1        // ECAP1_INT   (eCAP1 Int)
#define	G42PL       3        // ECAP2_INT   (eCAP2 Int)
#define	G43PL       2        // ECAP3_INT   (eCAP3 Int)
#define	G44PL       4        // reserved
#define	G45PL       0        // reserved
#define	G46PL       0        // reserved
#define	G47PL       1        // HRCAP1_INT	(HRCap1 Int)
#define	G48PL       3        // HRCAP2_INT	(HRCap2 Int)

#define	G51PL       1        // EQEP1_INT   (eQEP1 Int)
#define	G52PL       3        // EQEP2_INT   (eQEP2 Int)
#define	G53PL       0        // reserved
#define	G54PL       3        // HRCAP3_INT	(HRCap3 Int)
#define	G55PL       2        // HRCAP4_INT	(HRCap4 Int)
#define	G56PL       0        // reserved
#define	G57PL       0        // reserved
#define	G58PL       3        // USB0_INT	(USB0 Int)

