arduino/Arduino/hardware/c2000/cores/c2000/F2806x_common/include/F2806x_SWPrioritizedIsrLevels.h
#define	G61PL       2        // SPIRXINTA (SPI-A)
#define	G62PL       1        // SPITXINTA (SPI-A)
#define	G63PL       4        // SPIRXINTB (SPI-B)
#define	G64PL       4        // SPITXINTB (SPI-B)
#define	G65PL       2        // MRINTA	  (McBSP-A)
#define	G66PL       3        // MXINTA	  (McBSP-A)
#define	G67PL       0        // reserved
#define	G68PL       0        // reserved


#define	G71PL      1        // DMA Channel 1
#define	G72PL      2        // DMA Channel 2
#define	G73PL      3        // DMA Channel 3
#define	G74PL      2        // DMA Channel 4
#define	G75PL      6        // DMA Channel 5
#define	G76PL      4        // DMA Channel 6
#define	G77PL      0        // reserved
#define	G78PL      0        // reserved


#define	G81PL       1        // I2CINT1A  (I2C-A)
#define	G82PL       2        // I2CINT2A  (I2C-A)
#define	G83PL       0        // reserved
#define	G84PL       0        // reserved
#define	G85PL       0        // reserved
#define	G86PL       0        // reserved
#define	G87PL       0        // reserved
#define	G88PL       0        // reserved

#define	G91PL       1        // SCIRXINTA (SCI-A)
#define	G92PL       5        // SCITXINTA (SCI-A)
#define	G93PL       2        // SCIRXINTB (SCI-B)
#define	G94PL       4        // SCITXINTB (SCI-B)
#define	G95PL       6        // ECAN0INTA (eCAN-A)
#define	G96PL       1        // ECAN1INTA (eCAN-A)
#define	G97PL       0        // reserved
#define	G98PL       0        // reserved

#define	G101PL      0        // reserved  or ADCINT1 (define G11PL as 0 / reserved)
#define	G102PL      0        // reserved  or ADCINT2 (define G12PL as 0 / reserved)
#define	G103PL      1        // ADCINT3   (ADC)
#define	G104PL      4        // ADCINT4   (ADC)
#define	G105PL      5        // ADCINT5   (ADC)
#define	G106PL      7        // ADCINT6   (ADC)
#define	G107PL      7        // ADCINT7   (ADC)
#define	G108PL      3        // ADCINT8   (ADC)

#define	G111PL      1        // CLA1_INT1 (CLA)
#define	G112PL      2        // CLA1_INT2 (CLA)
#define	G113PL      4        // CLA1_INT3 (CLA)
#define	G114PL      3        // CLA1_INT4 (CLA)
#define	G115PL      5        // CLA1_INT5 (CLA)
#define	G116PL      1        // CLA1_INT6 (CLA)
#define	G117PL      7        // CLA1_INT7 (CLA)
#define	G118PL      1        // CLA1_INT8 (CLA)

#define	G121PL      1        // XINT3     (External)
#define	G122PL      3        // reserved
#define	G123PL      7        // reserved
#define	G124PL      2        // reserved
#define	G125PL      2        // reserved
#define	G126PL      0        // reserved
#define	G127PL      3        // LVF	(Latched Overflow)
#define	G128PL      2        // LUF (Latched Underflow)

// There should be no need to modify code below this line
//-------------------------------------------------------------------------------
// Automatically generate IER interrupt masks MINT1 to MINT16:
//

// Beginning of MINT1:
#if (INT1PL == 0)
#define  MINT1_1PL    ~(1 << 0)
#else
#define  MINT1_1PL    0xFFFF
#endif

#if (INT2PL >= INT1PL) || (INT2PL == 0)
#define  MINT1_2PL   ~(1 << 1)
#else
#define  MINT1_2PL   0xFFFF
#endif

#if (INT3PL >= INT1PL) || (INT3PL == 0)
#define  MINT1_3PL   ~(1 << 2)
#else
#define  MINT1_3PL   0xFFFF
#endif

#if (INT4PL >= INT1PL) || (INT4PL == 0)
#define  MINT1_4PL   ~(1 << 3)
#else
#define  MINT1_4PL   0xFFFF
#endif

#if (INT5PL >= INT1PL) || (INT5PL == 0)
#define  MINT1_5PL   ~(1 << 4)
#else
#define  MINT1_5PL   0xFFFF
#endif

#if (INT6PL >= INT1PL) || (INT6PL == 0)
#define  MINT1_6PL   ~(1 << 5)
#else
#define  MINT1_6PL   0xFFFF
#endif

#if (INT7PL >= INT1PL) || (INT7PL == 0)
#define  MINT1_7PL   ~(1 << 6)
#else
#define  MINT1_7PL   0xFFFF
#endif

#if (INT8PL >= INT1PL) || (INT8PL == 0)
#define  MINT1_8PL   ~(1 << 7)
#else
#define  MINT1_8PL   0xFFFF
#endif

#if (INT9PL >= INT1PL) || (INT9PL == 0)
#define  MINT1_9PL   ~(1 << 8)
#else
#define  MINT1_9PL   0xFFFF
#endif

#if (INT10PL >= INT1PL) || (INT10PL == 0)
#define  MINT1_10PL   ~(1 << 9)
#else
#define  MINT1_10PL   0xFFFF
#endif

#if (INT11PL >= INT1PL) || (INT11PL == 0)
#define  MINT1_11PL   ~(1 << 10)
#else
#define  MINT1_11PL   0xFFFF
#endif

#if (INT12PL >= INT1PL) || (INT12PL == 0)
#define  MINT1_12PL   ~(1 << 11)
#else
#define  MINT1_12PL   0xFFFF
#endif

#if (INT13PL >= INT1PL) || (INT13PL == 0)
#define  MINT1_13PL   ~(1 << 12)
#else
#define  MINT1_13PL   0xFFFF
#endif

#if (INT14PL >= INT1PL) || (INT14PL == 0)
#define  MINT1_14PL   ~(1 << 13)
#else
#define  MINT1_14PL   0xFFFF
#endif

#if (INT15PL >= INT1PL) || (INT15PL == 0)
#define  MINT1_15PL   ~(1 << 14)
#else
#define  MINT1_15PL   0xFFFF
#endif

#if (INT16PL >= INT1PL) || (INT16PL == 0)
#define  MINT1_16PL   ~(1 << 15)
#else
#define  MINT1_16PL   0xFFFF
#endif

#define  MINT1    (MINT1_1PL  & MINT1_2PL  & MINT1_3PL  & MINT1_4PL  & \
                   MINT1_5PL  & MINT1_6PL  & MINT1_7PL  & MINT1_8PL  & \
                   MINT1_9PL  & MINT1_10PL & MINT1_11PL & MINT1_12PL & \
                   MINT1_13PL & MINT1_14PL & MINT1_15PL & MINT1_16PL)
// End Of MINT1.

// Beginning of MINT2:
#if (INT1PL >= INT2PL) || (INT1PL == 0)
#define  MINT2_1PL    ~(1 << 0)
#else
#define  MINT2_1PL    0xFFFF
#endif

#if (INT2PL == 0)
#define  MINT2_2PL   ~(1 << 1)
#else
#define  MINT2_2PL   0xFFFF
#endif

#if (INT3PL >= INT2PL) || (INT3PL == 0)
#define  MINT2_3PL   ~(1 << 2)
#else
#define  MINT2_3PL   0xFFFF
#endif

#if (INT4PL >= INT2PL) || (INT4PL == 0)
#define  MINT2_4PL   ~(1 << 3)
#else
#define  MINT2_4PL   0xFFFF
#endif

#if (INT5PL >= INT2PL) || (INT5PL == 0)
#define  MINT2_5PL   ~(1 << 4)
#else
#define  MINT2_5PL   0xFFFF
#endif

#if (INT6PL >= INT2PL) || (INT6PL == 0)
#define  MINT2_6PL   ~(1 << 5)
#else
#define  MINT2_6PL   0xFFFF
#endif

#if (INT7PL >= INT2PL) || (INT7PL == 0)
#define  MINT2_7PL   ~(1 << 6)
#else
#define  MINT2_7PL   0xFFFF
#endif

#if (INT8PL >= INT2PL) || (INT8PL == 0)
#define  MINT2_8PL   ~(1 << 7)
#else
#define  MINT2_8PL   0xFFFF
#endif

#if (INT9PL >= INT2PL) || (INT9PL == 0)
#define  MINT2_9PL   ~(1 << 8)
#else
#define  MINT2_9PL   0xFFFF
#endif

